fn main() {
    // 闭包捕获环境变量, 下面在闭包中使用了外部的变量x
    // 当闭包从环境中捕获一个值，闭包会在闭包体中储存这个值以供使用，这会使用内存并产生额外的开销
    // 闭包可以通过三种方式捕获其环境，它们对应着函数的三种获取参数的方式：获取所有权，可变引用和不可变引用
    // FnOnce：获取所有权并且在定义闭包的时候就将所有权移动到闭包内，因为变量的所有权只能被移动一次，所以这个闭包函数也只能调用1次，这就是Once的含义
    // FnMut：获取可变引用，意味着可以改变环境
    // Fn：获取不可变引用
    let mut x = 4;
    let equal_to_x = |input| input == x;
    let y = 4;
    println!("4 equal_to_x is {}", equal_to_x(y));

    // Rust根据闭包体中是如何使用环境来推断这个闭包的类型
    // 不加 move（默认情况）：闭包会捕获环境变量的引用（&T 或 &mut T）。即使 T 是 Copy 类型，默认也是建立引用。
    // 加上 move 关键字：闭包会强制将环境中的变量所有权移动进闭包。但如果该类型实现了 Copy（比如 i32），移动就会变成复制——即在闭包内部复制一份独立的值，而外部原变量的所有权依然保留在外部。
}
