fn main() {
    // 1 所有权系统是为了释放堆上的内存，栈上的内存随着出栈直接释放，不需要所有权系统

    // 2 所有权的规则
    // 2.1 每个值都有一个叫做所有者的变量
    // 2.2 任一时刻只有一个所有者
    // 2.3 当所有者(变量)离开作用域，值将被丢弃(调用drop方法)

    // 3 变量和数据交互的方式：移动或者复制
    // 非Copy类型的数据：例如String
    // - 默认情况：移动，所有权转移，堆数据不发生复制，原变量失去所有权无法访问
    // - 显示调用clone()方法：克隆，所有权不转移，堆内存数据发生复制，原变量保持所有权可以访问
    // Copy类型的数据：例如i32,&T
    // - 默认情况：复制，所有权不转移，原变量保持所有权可以访问

    // 4 注意：rust中没有深浅拷贝一说，Copy类型就是复制，非Copy类型就是移动，非Copy类型调用clone方法就是连带堆内存一起复制
    // *****判断会不会发生移动的原则就是数据有没有实现Copy
    // *****Copy类型没有drop方法，非Copy类型在离开作用域时调用drop方法释放堆上的内存

    // demo1: 将5绑定到变量x1上(变量x1的盒子中装的是5)；x1中的5是Copy类型，将5拷复制一份绑定给x2
    let x1 = 5;
    let x2 = x1;

    // demo2: 堆内存上存储了"wlh", 将<指向wlh的指针，长度，容量>绑定给s1(变量s1的盒子中装的是<指针，长度，容量>)
    // 此时发生的是 将s1中的<指针，长度，容量> 移动到了 s2的盒子中，s1的盒子中空了
    // 特别注意不是把<指针，长度，容量>复制一份放到s2中哦，这种在别的语言中叫做浅拷贝，但是在rust中不是这样的
    // 所以rust中叫移动move，这样设计的原因是防止二次释放内存，假设是浅拷贝的话，那么s1和s2中的指针都指向了同一块内存
    // 那么在s1和s2在离开作用域时，会释放两次内存，重大bug
    let s1 = String::from("wlh");
    let s2 = s1;

    // demo3: 如果想将非Copy类型在堆上完全复制一份，可以使用clone方法
    // 这种方式在堆内存上有两份wlh，ss1 和 ss2在离开作用域时释放的也是不同的内存
    let ss1 = String::from("wlh");
    let ss2 = ss1.clone();

    // 5 函数调用中的移动和复制依然和数据是否实现Copy有关，数据实现了Copy那么是复制，
    // 数据没有实现Copy那么是移动，所有权发生改变
    // demo1
    let s = String::from("hello");
    take_ownership(s); // 非Copy类型发生移动
    // println!("s = {}", s); // 这里会报错
    let i = 5;
    make_copy(i); // Copy类型发生复制
    println!("i = {}", i); // 可以使用
} // s离开作用域，因为移动了，所以s不用调用drop方法，i随着出栈直接释放

fn take_ownership(input: String) {
    // 所有权移动给input
    println!("take_ownership input={}", input);
} // input离开作用域，调用drop

fn make_copy(input: i32) {
    println!("make_copy input={}", input);
}
